# RebarSystemSpacingBottomDir2Generic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemSpacingBottomDir2Generic Property
ParameterTypeId Class See Also
---
"Bottom/Interior Minor Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemSpacingBottomDir2Generic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemSpacingBottomDir2Generic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemSpacingBottomDir2Generic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace